//проанализировать временной промежуток начиная с 1800 и до 2020 года и найти и вывести в консоль:
//1961год (кол-во) итераций
// високосные года и кол-во итераций
console.log('Анализ временного промежутока начиная с 1800 и до 2020 года:');
for(let n=1800 ; n<=2020;n++ ){
    console.log('<--Кол-во итераций до 1961года; Первый полёт человека в космос')
    if(n===1961){
        break;
    }
    }
for(let n =1800; n<=2020;n+=4){
    console.log('<--Кол-во високосных годов в заданном нам промежутке')
 }